tap "homebrew/bundle"
tap "homebrew/core"
if RUBY_PLATFORM[/darwin/]
  tap "homebrew/autoupdate"
  tap "homebrew/cask"
  tap "homebrew/cask-drivers"
  tap "homebrew/cask-fonts"
  tap "homebrew/cask-versions"
  tap "homebrew/command-not-found"
  tap "homebrew/services"
  tap "homebrew/test-bot"
  tap "mas-cli/tap"
  brew "ack"
  brew "asciidoctor"
  brew "bash"
  brew "bash-completion@2"
  brew "bat"
  brew "brew-cask-completion"
  brew "bundler-completion"
  brew "direnv"
  brew "duf"
  brew "fzf"
  brew "gem-completion"
  brew "gh"
  brew "grc"
  brew "htop"
  brew "hyperfine"
  brew "jq"
  brew "m-cli"
  brew "mas"
  brew "most"
  brew "ncdu"
  brew "nmap"
  brew "openssh"
  brew "openjdk"
  brew "realpath"
  brew "parallel"
  brew "pip-completion"
  brew "rsync"
  brew "ruby-completion"
  brew "speedtest-cli"
  brew "starship"
  brew "telnet"
  brew "tor", restart_service: true
  brew "tree"
  brew "vim"
  brew "watchman"
  brew "wget"
  brew "whalebrew"
  cask "adobe-acrobat-reader"
  cask "adoptopenjdk"
  cask "docker"
end
